backend/controllers/BitcoinwalletController.php

                $type = 'SH and GH wallet';
        }

        $BitcoinWallet = BitcoinWallet::find()->where(['type'=>$id])->orderBy(['created_at'=> SORT_DESC])->all();
---
SELECT * FROM `bitcoin_wallet` WHERE `type`='2' ORDER BY `created_at` DESC

    public function actionView($id)
    {
        define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);

        $BitcoinWallet = BitcoinWallet::findOne($id);
---
SELECT * FROM `bitcoin_wallet` WHERE `id`='23'