backend/controllers/TokenmanagementController.php

SELECT * FROM `token_request` WHERE `mode`=2 ORDER BY `created_at` DESC
---
    public function actionTransfer()
    {
        $tokenfilter = new TokenFilter;
        $query = TokenRequest::find();
        if ($tokenfilter->load(Yii::$app->request->get())) {
            $query->where(['mode' => TokenRequest::MODE_TRANS]);
            if(!empty($tokenfilter->username)){
                $query->andWhere(["IN", "user_id", $tokenfilter->getUser($tokenfilter->username)]);
            }
            if(!empty($tokenfilter->dayfrom)){
                $date=date_create($tokenfilter->dayfrom);
                $datefrom = strtotime(date_format($date,"m/d/Y"));
                $query->andWhere([">", "created_at", $datefrom]);
            }
            if(!empty($tokenfilter->dayto)){
                $date=date_create($tokenfilter->dayto);
                $dateto = strtotime(date_format($date,"m/d/Y 23:59"));
                $query->andWhere(["<", "created_at", $dateto]);
            }
        }else{
            $query->where(['mode' => TokenRequest::MODE_TRANS]);
        }

        $model = $query->orderBy(['created_at' => SORT_DESC])->all();