frontend/controllers/BitwalletController.php

    public function actionIndex()
    {

    	if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('bitwallet/index'));
        }
        $this->canUser();

        define("IN_WALLET", true);
        $user = User::findOne(Yii::$app->user->identity->id);

        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);
        $address_btc = $client->getAddressList($user->username);
        $balance_btc = $client->getBalance($user->username);
        $transction_btc = $client->getTransactionList($user->username);

        $BuyBtc = BuyBtc::find()->groupBy(['country_id'])->orderBy(['country_id'=>SORT_ASC])->all();

        $country_id = BuyBtc::find()->groupBy(['country_id'])->orderBy(['country_id'=>SORT_ASC])->one();

        $listAddress = BuyBtc::find()->where(['country_id' => $country_id->country_id])->orderBy(['country_id'=>SORT_ASC])->all();

        //get account sg/gh, token, charity, luckydraw
        $bitcoinWallet = BitcoinWallet::find()->all();
---
SELECT * FROM `user` WHERE `id`=2102
SELECT * FROM `buy_btc` GROUP BY `country_id` ORDER BY `country_id`
SELECT * FROM `buy_btc` WHERE `country_id`=2 ORDER BY `country_id`
SELECT * FROM `bitcoin_wallet`