frontend/controllers/FrontendController.php

SELECT * FROM `user` WHERE `id`=2102
---
    protected function canUser() {
        //check block account
        $user = User::findOne(Yii::$app->user->identity->id);