frontend/controllers/GethelpController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('gethelp/index'));
        }
        $this->canUser();

        define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);

        $model_bonus = new GhBonuswallet;
        $model_main = new GhTransfer;
		$model_bonus_db = new GhTransfer;
        $BitcoinWallet = new BitcoinWallet;


        //get account bitcoin wallet max amount
        $account_wallettoken = $BitcoinWallet->findBitcoinaddress(BitcoinWallet::TYPE_ShAndGhwallet, 'max');
        //get balance account_wallettoken
        $balance_wallettoken = $client->getBalance($account_wallettoken);

    	$user = User::findOne(Yii::$app->user->identity->id);

        $address_btc = $client->getAddressList($user->username);

        //get amount sh/gh amount for level user
        $amountsh = AmountGethelp::find()->where(['level'=>$user->level])->one();
---
SELECT * FROM `user` WHERE `id`=2137
SELECT * FROM `amount_gethelp` WHERE `level`=2

        $total_amount = $model_bonus->findTotalghinmonth(Yii::$app->user->identity->id);

        //get all gh transfer by id user
        $gethelptransfer = GhTransfer::find()->where(['user_id'=>Yii::$app->user->identity->id])->orderBy(['created_at'=>SORT_DESC])->all();
---
SELECT * FROM `gh_transfer` WHERE `user_id`=2137 ORDER BY `created_at` DESC

    public function actionGettokenforghbonus(){
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $amount = $_POST['amount'];
        $type = $_POST['type'];
        if($type == GhTransfer::STATUS_BONUS){
            $TokenForgethelp = TokenForgethelp::find()->where(['<', 'min_bonusw', (float)$amount])->andWhere(['>=', 'max_bonusw', (float)$amount])->one();
        }
        if($type == GhTransfer::STATUS_MAIN){
            $TokenForgethelp = TokenForgethelp::find()->where(['<', 'min_mainw', (float)$amount])->andWhere(['>=', 'max_mainw', (float)$amount])->one();
---
SELECT * FROM `token_forgethelp` WHERE (`min_mainw` < 0.0051926) AND (`max_mainw` >= 0.0051926)

    public function actionStandbygethelp(){
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);
        $BitcoinWallet = new BitcoinWallet;
        $standbytimegh = Converted::find()->where(['object'=>'standbytimegh'])->one();
        $ghtransfer  = GhTransfer::find()->where(['publish'=>GhTransfer::PUBLISH_NOACTIVE])->all();
        foreach ($ghtransfer as $key => $gethelp) {
            if( (60 * $standbytimegh->value +$gethelp->created_at) <= time() ){
                $gh = GhTransfer::findOne($gethelp->id);
                $user = User::findOne($gh->user_id);
---
SELECT * FROM `converted` WHERE `object`='standbytimegh'
SELECT * FROM `gh_transfer` WHERE `publish`=1
SELECT * FROM `gh_transfer` WHERE `id`=5406
SELECT * FROM `user` WHERE `id`=947