frontend/controllers/ReferralsController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('referrals/index'));
        }
        $this->canUser();
        $model = new User;
        $searchuser = new SearchuserForm;

        if(!empty($_GET['id'])) {
            $id_user = $_GET['id'];
        } else {
            $id_user = Yii::$app->user->identity->id;
        }

        //get network of user login
        $data_member = array();
        $members_network_of_userlog = array();
        $members_network_log = $model->getDownlinetreemember(Yii::$app->user->identity->id, $data_member);
        foreach ($members_network_log as $arr_mem) {
            foreach ($arr_mem as $id_mem) {
                $members_network_of_userlog[] .= $id_mem;
            }
        }

        //check iseet id_user
        $this_user = User::findOne($id_user);
---
SELECT * FROM `user` WHERE `id`=360

            }
        }

    	$user = User::find()->where(['referral_user_id' => $id_user, 'status' => User::STATUS_ACTIVE])->orderBy(['created_at' => SORT_ASC])->all();

        if(!empty($this_user->referral_user_id)){
            $referral_user_id = User::findOne($this_user->referral_user_id);
---
SELECT * FROM `user` WHERE (`referral_user_id`=360) AND (`status`=2) ORDER BY `created_at`
SELECT * FROM `user` WHERE `id`=328