frontend/controllers/SendhelpController.php

SELECT * FROM `sh_transfer` WHERE ((`user_id`=2082) AND (`publish`=2)) AND (`status` < 4) ORDER BY `created_at` DESC
SELECT * FROM `sh_transfer` WHERE (`user_id`=2082) AND (`publish`=2) AND (`status`=4) ORDER BY `created_at`
SELECT * FROM `amount_gethelp` WHERE `level`=1
---
    public function actionIndex()
    {
        if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('sendhelp/index'));
        }
        $this->canUser();

        define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);
        $model = new ShTransfer;
        $sendhelpTransfer = new SendhelpTransfer;
        $BitcoinWallet = new BitcoinWallet;

        //check shtransfer completed
        $model->checkallShtransfer;

    	$btc = $client->getBalance(Yii::$app->user->identity->username);
        $token = Yii::$app->user->identity->token;
    	$level = Yii::$app->user->identity->level;
        $id = Yii::$app->user->identity->id;

        //get all sh transfer active
        $active_sh = ShTransfer::find()->where(['user_id'=>$id, 'publish'=>ShTransfer::PUBLISH_ACTIVE])->andWhere(['<','status', ShTransfer::STATUS_COMPLETED])->orderBy(['created_at'=>SORT_DESC])->all();
    	//get all sh transfer complete
        $complete_sh = ShTransfer::find()->where(['user_id'=>$id, 'publish'=>ShTransfer::PUBLISH_ACTIVE, 'status'=> ShTransfer::STATUS_COMPLETED])->orderBy(['created_at'=>SORT_ASC])->all();
        //get amount sh/gh amount for level user
        $amountsh = AmountGethelp::find()->where(['level'=>$level])->one();

SELECT `amount_sh` FROM `level_setting` WHERE `level`=1
---
        //get amount sh active in this month
        //$shactive_thismonth = $model->findAmountshActiveThismonth(Yii::$app->user->identity->id);
        //get amount sh permitted in this month
        $sh_permitted = LevelSetting::find()->select('amount_sh')->where(['level'=>Yii::$app->user->identity->level])->one();

SELECT * FROM `sh_transfer` WHERE ((`user_id`=2082) AND (`publish`=2) AND (`status`=4)) AND (`amount` > 0) ORDER BY `created_at` DESC LIMIT 10
---
        }

        //get all sh transfer by id user
        $sendhelptransfer = ShTransfer::find()->where(['user_id'=>Yii::$app->user->identity->id, 'publish'=>ShTransfer::PUBLISH_ACTIVE, 'status'=> ShTransfer::STATUS_COMPLETED])->andWhere(['>', 'amount', 0])->orderBy(['created_at'=>SORT_DESC])->limit(10)->all();

SELECT * FROM `sh_transfer` WHERE `id`='992'
SELECT * FROM `user` WHERE `id`='2082'
UPDATE `user` SET `wallet`=0.04288367, `updated_at`=1491021528 WHERE `id`=2082
UPDATE `sh_transfer` SET `inc_days`=1491021528 WHERE `id`=992
INSERT INTO `sh_withdraw` (`id_shtransfer`, `amount`, `created_at`) VALUES (992, 0.04288367, 1491021528)
---
    public function actionWithdrawprofit(){
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $id_sh = $_POST['id_sh'];
        $id_user = $_POST['id_user'];

        $level = Yii::$app->user->identity->level;

        $sh_transfer = ShTransfer::findOne($id_sh);

        $profit_packet = $sh_transfer->getProfitdailyUserlevel($sh_transfer->id);

        $daily_profit = $sh_transfer->amount * $profit_packet / 100 / 86400;
        $amount_profit = (time()- $sh_transfer->inc_days) * $daily_profit;

        $profit = round($amount_profit, 8);

        //add to gh wallet
        $user = User::findOne($id_user);
        $user->wallet = $user->wallet + $profit;
        $user->save();

        //update inc_days in sh transfer
        $sh_transfer->inc_days = time();
        $sh_transfer->save();

        //insert sh withdraw
        $sh_withdraw = new ShWithdraw;
        $sh_withdraw->id_shtransfer = $id_sh;
        $sh_withdraw->amount = $profit;
        $sh_withdraw->created_at = time();
        if($sh_withdraw->save()){