frontend/controllers/SiteController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('site/index'));
        }
        $this->canUser();
        define("IN_WALLET", true);

        $user = User::findOne(Yii::$app->user->identity->id);

        //test mail
        // $mailtemplate = new MailTemplate;
        // $mailin = new Mailin('support@ebank.tv', 'QpRfvH4FGSN5tYKb');
        // $mailin->
        // addTo('thachbond@gmail.com', 'Michael Ingersoll')->
        // setFrom('support@ebank.tv', 'Michael Ingersoll')->
        // setReplyTo('support@ebank.tv','Michael Ingersoll')->
        // setSubject('Enter the subject here')->
        // setText('Hello')->
        // setHtml('<strong>Hello</strong>');
        // $res = $mailin->send();
        // var_dump($res); exit;




        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);
        $address_btc = $client->getAddressList($user->username);
        $balance_btc = $client->getBalance($user->username);
        $model = Newsmanagement::find()->where(['publish' => Newsmanagement::PUBLISH_ACTIVE])->orderBy(['created_at' => SORT_DESC])->all();
        $notification = Newsmanagement::find()->where(['id' => 13])->orderBy(['created_at' => SORT_DESC])->one();
        $program = CharityProgram::find()->where(['publish' => CharityProgram::PUBLISH_ACTIVE])->orderBy(['endday' => SORT_DESC])->limit(1)->all();
        //get all sh transfer active
        $active_sh = ShTransfer::find()->where(['user_id'=>$user->id, 'publish'=>ShTransfer::PUBLISH_ACTIVE])->andWhere(['<','status', ShTransfer::STATUS_COMPLETED])->orderBy(['created_at'=>SORT_DESC])->limit(2)->all();
---
SELECT * FROM `user` WHERE `id`=2195
SELECT * FROM `newsmanagement` WHERE `publish`=1 ORDER BY `created_at` DESC
SELECT * FROM `charity_program` WHERE `publish`=0 ORDER BY `endday` DESC LIMIT 1
SELECT * FROM `sh_transfer` WHERE ((`user_id`=2195) AND (`publish`=2)) AND (`status` < 4) ORDER BY `created_at` DESC LIMIT 2

    public function actionLogin()
    {
        $this->layout = 'login';
		$session = Yii::$app->session;

        if (!Yii::$app->user->isGuest && $session['is_auth_tw'] = '0') {
            return $this->goHome();
        }
		$session['is_auth_tw'] = '0';
        $model = new LoginForm();

        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $userDetails= User::find()->where(['id'=>Yii::$app->user->identity->id])->one();
---
SELECT * FROM `user` WHERE `id`=2284