frontend/controllers/TokenController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('token/index'));
        }
        $this->canUser();

        define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);

    	$bitpertoken = Converted::find()->where(['object'=>'token'])->one();
        $user = User::findOne(Yii::$app->user->identity->id);
    	$model = new TokenRequest();
        $TransferToken = new TransferToken();
        $BitcoinWallet = new BitcoinWallet;
        $balance = $client->getBalance($user->username);

        //get token can transfer
        //token gift wheren register
        $tokenregister = Converted::find()->where(['object'=>'tokenregister'])->one();
        //total token sh,gh
        $tokensh = 0;
        $tokengh = 0;
        $shtransfers = ShTransfer::find()->where(['user_id' => Yii::$app->user->identity->id])->all();
        if(!empty($shtransfers)){
            foreach ($shtransfers as $key => $shtransfer) {
                $tokenforsh = $shtransfer->getTokenamount($shtransfer->amount);
                $tokensh += $tokenforsh;
            }
        }
        $ghtransfers = GhTransfer::find()->where(['user_id' => Yii::$app->user->identity->id])->all();
---
SELECT * FROM `converted` WHERE `object`='token'
SELECT * FROM `user` WHERE `id`=2102
SELECT * FROM `converted` WHERE `object`='tokenregister'
SELECT * FROM `sh_transfer` WHERE `user_id`=2102
SELECT * FROM `gh_transfer` WHERE `user_id`=2102

            }
        }

        $query = TokenRequest::find()->where(['OR', ['user_id'=>Yii::$app->user->identity->id], ['reciever'=>Yii::$app->user->identity->id]])->andWhere(['publish'=>TokenRequest::PUB_ACTIVE])->orderBy(['created_at'=>SORT_DESC])->all();
---
SELECT * FROM `token_request` WHERE ((`user_id`=2102) OR (`reciever`=2102)) AND (`publish`=2) ORDER BY `created_at` DESC