frontend/controllers/UserController.php

SELECT * FROM `user` WHERE `id`=2195
SELECT * FROM `cities`
SELECT * FROM `states`
SELECT * FROM `countries`
SELECT * FROM `user` WHERE (`referral_user_id`=2195) AND (`status`=2)
SELECT COUNT(*) FROM `sh_transfer` WHERE `user_id`=2196
---
    public function actionView()
    {
		if (Yii::$app->user->isGuest){
            return $this->redirect('/login?redirect=' . Yii::$app->convert->redirect('user/view/'));
        }
        $this->canUser();

        $user = User::findOne(Yii::$app->user->identity->id);
        $cities = Cities::find()->all();
        $states = States::find()->all();
        $countries = Countries::find()->all();

        $direct_members = User::find()->where(['referral_user_id'=>Yii::$app->user->identity->id, 'status' => User::STATUS_ACTIVE])->all();
        $user_active = [];
        $time = time() - (86400 * 30);
        foreach ($direct_members as $key => $value) {
            $shTransfer_active = ShTransfer::find()->where(['user_id' => $value->id])->count();