frontend/components/widgets/TopbarWidget.php

SELECT * FROM `notify` WHERE (`receive_id`='2102') AND ((`publish`=0) AND (`receive_id`=2102)) ORDER BY `created_at` DESC LIMIT 4
SELECT COUNT(*) FROM (SELECT * FROM `notify` WHERE (`receive_id`=2102) AND ((`publish`=0) AND (`receive_id`=2102)) GROUP BY `all_id`, `receive_id`) `c`
SELECT * FROM `conversation` WHERE (`user_first`=2102) OR (`user_second`=2102)
SELECT * FROM `chat_messages` WHERE ((`id_conversation`=110) AND (`status`=1)) AND (`user_id` <> 2102)
---
	public function run()
    {
        $model = Notify::find()->where(['receive_id' => (string) Yii::$app->user->identity->id])->andWhere(['publish' => Notify::PUBLISH_NOACTIVE, 'receive_id'=>Yii::$app->user->identity->id])->orderBy(['created_at' => SORT_DESC])->limit(4)->all();
        $countmessage = Notify::find()->where(['receive_id' => Yii::$app->user->identity->id])->groupBy(['all_id', 'receive_id'])->andWhere(['publish' => Notify::PUBLISH_NOACTIVE, 'receive_id'=>Yii::$app->user->identity->id])->count();

        //get conversation not seen
        $conversations = Conversation::find()->where(['user_first'=>Yii::$app->user->identity->id])->orWhere(['user_second'=>Yii::$app->user->identity->id])->all();
        $count_conver = 0;
        if(!empty($conversations)){
            foreach ($conversations as $key => $convers) {
                $messages = ChatMessages::find()->where(['id_conversation' => $convers->id, 'status' => ChatMessages::STATUS_NOACTIVE])->andWhere(['<>', 'user_id', Yii::$app->user->identity->id])->one();