common/models/Account.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `accounts` WHERE (`username`='richman') AND (`status`=10)