common/models/BitcoinWallet.php

    public static function findBitcoinaddress($id, $type){
        //define("IN_WALLET", true);
        $client = new Client(Yii::$app->params['rpc_host'], Yii::$app->params['rpc_port'], Yii::$app->params['rpc_user'], Yii::$app->params['rpc_pass']);
        $bitcwallet = new BitcoinWallet;
        $BitcoinWallet = BitcoinWallet::find()->where(['type'=>$id, 'publish'=>BitcoinWallet::PUBLISH_ACTIVE])->orderBy(['created_at'=> SORT_DESC])->all();
---
SELECT * FROM `bitcoin_wallet` WHERE (`type`=1) AND (`publish`=2) ORDER BY `created_at` DESC