common/models/BuyBtc.php

    public static function findCountry($id){
        return Countries::findOne($id);
---
SELECT * FROM `countries` WHERE `id`=2