common/models/Cashwithdraw.php

    public function getListCurrency()
    {
        $currency = Currency::find()->orderBy(['country'=>SORT_ASC])->all();
---
SELECT * FROM `currency` ORDER BY `country`