common/models/GhTransfer.php

SELECT * FROM `gh_transfer` WHERE `user_id`=2137 ORDER BY `created_at`
SELECT SUM(amount) FROM `gh_transfer` WHERE ((`user_id`=2137) AND (`created_at` > 1493611954)) AND (`created_at` < 1496290354)
---
    public static function findTotalghinmonth($id){
        $date_time_now = date('Y/m/d', time());
        $first_gh_transfer = GhTransfer::find()->where(['user_id'=>$id])->orderBy(['created_at'=>SORT_ASC])->one();
        if(!empty($first_gh_transfer)){
            $first_gh_transfer_date = date('d', $first_gh_transfer->created_at);
            //first day of month
            $first_day_ofmonth = substr($date_time_now, 0, -2).$first_gh_transfer_date.' '.date('H:i:s', $first_gh_transfer->created_at);
            //last day of month
            $last_day_ofmonth = date("Y-m-d H:i:s", strtotime("+1 month", strtotime($first_day_ofmonth)));

            $strtime_firstday = strtotime($first_day_ofmonth);
            $strtime_lastday = strtotime($last_day_ofmonth);

            $sum_amount = GhTransfer::find()->where(['user_id'=>$id])->andWhere(['>','created_at', $strtime_firstday])->andWhere(['<','created_at', $strtime_lastday])->sum('amount');

SELECT * FROM `token_forgethelp` WHERE (`min_mainw` < 0.005192) AND (`max_mainw` >= 0.005192)
---
    public static function getTokenamount($amount, $type){
        if($type == GhTransfer::STATUS_BONUS){
            $TokenForgethelp = TokenForgethelp::find()->where(['<', 'min_bonusw', (float)$amount])->andWhere(['>=', 'max_bonusw', (float)$amount])->one();
        }
        if($type == GhTransfer::STATUS_MAIN){
            $TokenForgethelp = TokenForgethelp::find()->where(['<', 'min_mainw', (float)$amount])->andWhere(['>=', 'max_mainw', (float)$amount])->one();