common/models/ShTransfer.php

    public static function getTokenamount($amount){
        $TokenForsendhelp = TokenForsendhelp::find()->where(['<', 'min_amount', (int)$amount])->andWhere(['>=', 'max_amount', (int)$amount])->one();
---
SELECT * FROM `token_forsendhelp` WHERE (`min_amount` < 1) AND (`max_amount` >= 1)

    public static function findTotalshinmonth($id){
        $date_time_now = date('Y/m/d', time());
        $first_sh_transfer = ShTransfer::find()->where(['user_id'=>$id])->orderBy(['created_at'=>SORT_ASC])->one();
        if(!empty($first_sh_transfer)){
            $first_sh_transfer_date = date('d', $first_sh_transfer->created_at);
            //first day of month
            $first_day_ofmonth = substr($date_time_now, 0, -2).$first_sh_transfer_date.' '.date('H:i:s', $first_sh_transfer->created_at);
            //last day of month
            $last_day_ofmonth = date("Y-m-d H:i:s", strtotime("+1 month", strtotime($first_day_ofmonth)));

            // $strtime_firstday = strtotime($first_day_ofmonth);
            // $strtime_lastday = strtotime($last_day_ofmonth);
            $strtime_firstday = strtotime(date("Y-n-j", strtotime("first day of this month")));
            $strtime_lastday = strtotime(date("Y-n-j", strtotime("last day of this month")));
            //var_dump($strtime_lastday); exit;

            $sum_amount = ShTransfer::find()->where(['user_id'=>$id])->andWhere(['>=','created_at', $strtime_firstday])->andWhere(['<=','created_at', $strtime_lastday])->sum('amount');
---
SELECT * FROM `sh_transfer` WHERE `user_id`=2082 ORDER BY `created_at`
SELECT SUM(amount) FROM `sh_transfer` WHERE ((`user_id`=2082) AND (`created_at` >= 1491004800)) AND (`created_at` <= 1493510400)

    public static function getTotalprofit($id){
        //get total the amount of interest was drawn by user
        $total = ShWithdraw::find()->where(['id_shtransfer' => $id])->sum('amount');
---
SELECT SUM(amount) FROM `sh_withdraw` WHERE `id_shtransfer`=992

    public static function getShwithdraw($id){
        return ShWithdraw::find()->where(['id_shtransfer'=>$id])->all();
---
SELECT * FROM `sh_withdraw` WHERE `id_shtransfer`=992

    public static function getProfitdaily($id){
        $sendhelp = ShTransfer::findOne($id);
        $ProfitForsendhelp = ProfitForsendhelp::find()->where(['packet_sh'=> $sendhelp->sh_packet_id])->one();
---
SELECT * FROM `sh_transfer` WHERE `id`=992
SELECT * FROM `profit_forsendhelp` WHERE `packet_sh`=5