common/models/TokenRequest.php

    public static function getUser($id){
        return User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=191