common/models/User.php

    public static function findManagerparent($id = NULL, &$data = []){
        $user = User::findOne($id);
        if(!empty($user)){
            $data[] = $user->referral_user_id;
            $user->findManagerparent($user->referral_user_id, $data);
---
SELECT * FROM `user` WHERE `referral_user_id`=360

    public static function getTotalSh($id){
        return ShTransfer::find()->where(['user_id' => $id])->sum('amount');
---
SELECT SUM(amount) FROM `sh_transfer` WHERE `user_id`=2195

    public static function getUserSh($id)
    {
        return ShTransfer::find()->where(['user_id'=>$id])->sum('amount');
---
SELECT SUM(amount) FROM `gh_transfer` WHERE `user_id`=2195