frontend/views/layouts/main.php

use frontend\components\widgets\TopbarWidget;
use common\models\Newsmanagement;

$notification = Newsmanagement::find()->where(['id' => 13])->orderBy(['created_at' => SORT_DESC])->one();
---
SELECT * FROM `newsmanagement` WHERE `id`=13 ORDER BY `created_at` DESC