backend/models/GhTransferFilter.php

SELECT * FROM `user` WHERE `country_id` <> '23'
---
	public static function getUserNotjap(){
        $user = User::find()->where(['<>', 'country_id', '23'])->all();