backend/models/UserFilter.php

SELECT * FROM `level_setting` ORDER BY `level`
---
    public function getListLevel(){
        $levels = LevelSetting::find()->orderBy(['level'=>SORT_ASC])->all();

SELECT * FROM `countries` WHERE `publish`=1 ORDER BY `name`
---
    public function getListCountry(){
        $countries = Countries::find()->where(['publish'=>Countries::PUBLISH_ACTIVE])->orderBy(['name'=>SORT_ASC])->all();