backend/views/ghmanagement/index.php

use common\extensions\jsonRPCClient;
use common\extensions\Client;

$pending_count =  GhTransfer::find()->where(['publish' => GhTransfer::PUBLISH_NOACTIVE])->sum('amount');
---
SELECT SUM(amount) FROM `gh_transfer` WHERE `publish`=1